<?php

require_once('helpers.php');
//date_default_timezone_set('Asia/Novokuznetsk');

$is_auth = random_int(0, 1);

$categories = [
    'Доски и лыжи',
    'Крепления',
    'Ботинки',
    'Одежда',
    'Инструменты',
    'Разное',
];

$goods = [
    [
        'название' => '2014 Rossignol District Snowboard',
        'категория' => 'Доски и лыжи',
        'цена' => 10999,
        'картинка' => 'img/lot-1.jpg',
        'дата истечения' => '2021-10-11',
    ],
    [
        'название' => 'DC Ply Mens 2016/2017 Snowboard',
        'категория' => 'Доски и лыжи',
        'цена' => 159999,
        'картинка' => 'img/lot-2.jpg',
        'дата истечения' => '2021-09-11',
    ],
    [
        'название' => 'Крепления Union Contact Pro 2015 года размер L/XL',
        'категория' => 'Крепления',
        'цена' => 8000,
        'картинка' => 'img/lot-3.jpg',
        'дата истечения' => '2021-08-12',
    ],
    [
        'название' => 'Ботинки для сноуборда DC Mutiny Charocal',
        'категория' => 'Ботинки',
        'цена' => 10999,
        'картинка' => 'img/lot-4.jpg',
        'дата истечения' => '2021-07-11',
    ],
    [
        'название' => 'Куртка для сноуборда DC Mutiny Charocal',
        'категория' => 'Одежда',
        'цена' => 7500,
        'картинка' => 'img/lot-5.jpg',
        'дата истечения' => '2021-06-11',
    ],
    [
        'название' => 'Маска Oakley Canopy',
        'категория' => 'Разное',
        'цена' => 5400,
        'картинка' => 'img/lot-6.jpg',
        'дата истечения' => '2021-10-09',
    ],
];

// Подключение главной страницы
$main = include_template(
    'main.php',
    [
        'categories' => $categories,
        'goods' => $goods,
    ]
);

// Передача переменных, и контента - лейауту
$layout = include_template(
    'layout.php',
    [
        'content' => $main,
        'title' => 'Главная страница',
        'user_name' => 'Антон',
        'is_auth' => $is_auth,
        'categories' => $categories,
    ]
);

print($layout);
